; domain
(define (domain zenotravel)
	(:requirements :typing :negative-preconditions)
	(:types
		Time - Object
		City - Object
		Aircraft - Thing
		Person - Thing
		Thing - Object
		FLevel - Object
	)
	(:predicates
		(at ?arg0 - Thing ?arg1 - City)
		(in ?arg0 - Person ?arg1 - Aircraft)
		(next ?arg0 - FLevel ?arg1 - FLevel)
		(max ?arg0 - FLevel)
        (min ?arg0 - FLevel)
        (not-min ?arg0 - FLevel)
		(fuel-level ?arg0 - Aircraft ?arg1 - FLevel)
	)
	(:action board
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(at ?p ?c)
                (at ?a ?c)
			)
		:effect
			(and
				(not (at ?p ?c))
				(in ?p ?a)
			)
	)

	(:action debark
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(in ?p ?a)
                (at ?a ?c)
			)
		:effect
			(and
				(not (in ?p ?a))
				(at ?p ?c)
			)
	)

	(:action refuel
		:parameters (?a - Aircraft ?l - FLevel ?l1 - FLevel)
		:precondition
			(and
				(fuel-level ?a ?l)
			)
		:effect
			(and
				(not (fuel-level ?a ?l))
				(fuel-level ?a ?l1)
			)
	)

	(:action fly
		:parameters (?a - Aircraft ?c1 - City ?c2 - City ?l1 - FLevel ?l2 - FLevel)
		:precondition
			(and
				(at ?a ?c1)
				(fuel-level ?a ?l1)
                (next ?l2 ?l1)
			)
		:effect
			(and
				(not (at ?a ?c1))
				(at ?a ?c2)
				(not (fuel-level ?a ?l1))
				(fuel-level ?a ?l2)
			)
	)
)

; problem
(define (problem p5)
(:domain zenotravel)
(:objects
 f0 f1 f2 - FLevel
 a1 - Aircraft
 c1 c2 c3 c4 c5 - City
 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 - Person
)
(:init
(min f0) (max f2)
(next f0 f1)
(not-min f1)
(next f1 f2)
(not-min f2)
(fuel-level a1 f2) (at a1 c5)
(at p1 c2)
(at p2 c4)
(at p3 c2)
(at p4 c2)
(at p5 c4)
(at p6 c5)
(at p7 c5)
(at p8 c3)
(at p9 c5)
(at p10 c4)
(at p11 c2)
(at p12 c2)
(at p13 c1)
(at p14 c1)
(at p15 c1)
(at p16 c4)
)
(:goal (and
(at a1 c5)
(at p1 c4)
(at p2 c3)
(at p3 c4)
(at p4 c4)
(at p5 c3)
(at p6 c5)
(at p7 c1)
(at p8 c2)
(at p9 c1)
(at p10 c3)
(at p11 c2)
(at p12 c3)
(at p13 c3)
(at p14 c2)
(at p15 c1)
(at p16 c3)
))
)

; plan
1. (fly a1 c5 c2 f2 f1)
   deleted: (at a1 c5) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 3 of 17
2. (board p1 a1 c2)
   deleted: (at p1 c2)
   added: (in p1 a1)
   goals met: 3 of 17
3. (fly a1 c2 c4 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c4) (fuel-level a1 f0)
   goals met: 3 of 17
4. (debark p1 a1 c4)
   deleted: (in p1 a1)
   added: (at p1 c4)
   goals met: 4 of 17
5. (board p2 a1 c4)
   deleted: (at p2 c4)
   added: (in p2 a1)
   goals met: 4 of 17
6. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 4 of 17
7. (fly a1 c4 c3 f2 f1)
   deleted: (at a1 c4) (fuel-level a1 f2)
   added: (at a1 c3) (fuel-level a1 f1)
   goals met: 4 of 17
8. (debark p2 a1 c3)
   deleted: (in p2 a1)
   added: (at p2 c3)
   goals met: 5 of 17
9. (fly a1 c3 c2 f1 f0)
   deleted: (at a1 c3) (fuel-level a1 f1)
   added: (at a1 c2) (fuel-level a1 f0)
   goals met: 5 of 17
10. (board p3 a1 c2)
   deleted: (at p3 c2)
   added: (in p3 a1)
   goals met: 5 of 17
11. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 5 of 17
12. (fly a1 c2 c4 f2 f1)
   deleted: (at a1 c2) (fuel-level a1 f2)
   added: (at a1 c4) (fuel-level a1 f1)
   goals met: 5 of 17
13. (debark p3 a1 c4)
   deleted: (in p3 a1)
   added: (at p3 c4)
   goals met: 6 of 17
14. (fly a1 c4 c2 f1 f0)
   deleted: (at a1 c4) (fuel-level a1 f1)
   added: (at a1 c2) (fuel-level a1 f0)
   goals met: 6 of 17
15. (board p4 a1 c2)
   deleted: (at p4 c2)
   added: (in p4 a1)
   goals met: 6 of 17
16. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 6 of 17
17. (fly a1 c2 c4 f2 f1)
   deleted: (at a1 c2) (fuel-level a1 f2)
   added: (at a1 c4) (fuel-level a1 f1)
   goals met: 6 of 17
18. (debark p4 a1 c4)
   deleted: (in p4 a1)
   added: (at p4 c4)
   goals met: 7 of 17
19. (board p5 a1 c4)
   deleted: (at p5 c4)
   added: (in p5 a1)
   goals met: 7 of 17
20. (fly a1 c4 c3 f1 f0)
   deleted: (at a1 c4) (fuel-level a1 f1)
   added: (at a1 c3) (fuel-level a1 f0)
   goals met: 7 of 17
21. (debark p5 a1 c3)
   deleted: (in p5 a1)
   added: (at p5 c3)
   goals met: 8 of 17
22. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 8 of 17
23. (fly a1 c3 c5 f2 f1)
   deleted: (at a1 c3) (fuel-level a1 f2)
   added: (at a1 c5) (fuel-level a1 f1)
   goals met: 9 of 17
24. (board p7 a1 c5)
   deleted: (at p7 c5)
   added: (in p7 a1)
   goals met: 9 of 17
25. (fly a1 c5 c1 f1 f0)
   deleted: (at a1 c5) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 8 of 17
26. (debark p7 a1 c1)
   deleted: (in p7 a1)
   added: (at p7 c1)
   goals met: 9 of 17
27. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 9 of 17
28. (fly a1 c1 c3 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c3) (fuel-level a1 f1)
   goals met: 9 of 17
29. (board p8 a1 c3)
   deleted: (at p8 c3)
   added: (in p8 a1)
   goals met: 9 of 17
30. (fly a1 c3 c2 f1 f0)
   deleted: (at a1 c3) (fuel-level a1 f1)
   added: (at a1 c2) (fuel-level a1 f0)
   goals met: 9 of 17
31. (debark p8 a1 c2)
   deleted: (in p8 a1)
   added: (at p8 c2)
   goals met: 10 of 17
32. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 10 of 17
33. (fly a1 c2 c5 f2 f1)
   deleted: (at a1 c2) (fuel-level a1 f2)
   added: (at a1 c5) (fuel-level a1 f1)
   goals met: 11 of 17
34. (board p9 a1 c5)
   deleted: (at p9 c5)
   added: (in p9 a1)
   goals met: 11 of 17
35. (fly a1 c5 c1 f1 f0)
   deleted: (at a1 c5) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 10 of 17
36. (debark p9 a1 c1)
   deleted: (in p9 a1)
   added: (at p9 c1)
   goals met: 11 of 17
37. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 11 of 17
38. (fly a1 c1 c4 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c4) (fuel-level a1 f1)
   goals met: 11 of 17
39. (board p10 a1 c4)
   deleted: (at p10 c4)
   added: (in p10 a1)
   goals met: 11 of 17
40. (fly a1 c4 c3 f1 f0)
   deleted: (at a1 c4) (fuel-level a1 f1)
   added: (at a1 c3) (fuel-level a1 f0)
   goals met: 11 of 17
41. (debark p10 a1 c3)
   deleted: (in p10 a1)
   added: (at p10 c3)
   goals met: 12 of 17
42. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 12 of 17
43. (fly a1 c3 c2 f2 f1)
   deleted: (at a1 c3) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 12 of 17
44. (board p12 a1 c2)
   deleted: (at p12 c2)
   added: (in p12 a1)
   goals met: 12 of 17
45. (fly a1 c2 c3 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c3) (fuel-level a1 f0)
   goals met: 12 of 17
46. (debark p12 a1 c3)
   deleted: (in p12 a1)
   added: (at p12 c3)
   goals met: 13 of 17
47. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 13 of 17
48. (fly a1 c3 c1 f2 f1)
   deleted: (at a1 c3) (fuel-level a1 f2)
   added: (at a1 c1) (fuel-level a1 f1)
   goals met: 13 of 17
49. (board p13 a1 c1)
   deleted: (at p13 c1)
   added: (in p13 a1)
   goals met: 13 of 17
50. (fly a1 c1 c3 f1 f0)
   deleted: (at a1 c1) (fuel-level a1 f1)
   added: (at a1 c3) (fuel-level a1 f0)
   goals met: 13 of 17
51. (debark p13 a1 c3)
   deleted: (in p13 a1)
   added: (at p13 c3)
   goals met: 14 of 17
52. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 14 of 17
53. (fly a1 c3 c1 f2 f1)
   deleted: (at a1 c3) (fuel-level a1 f2)
   added: (at a1 c1) (fuel-level a1 f1)
   goals met: 14 of 17
54. (board p14 a1 c1)
   deleted: (at p14 c1)
   added: (in p14 a1)
   goals met: 14 of 17
55. (fly a1 c1 c2 f1 f0)
   deleted: (at a1 c1) (fuel-level a1 f1)
   added: (at a1 c2) (fuel-level a1 f0)
   goals met: 14 of 17
56. (debark p14 a1 c2)
   deleted: (in p14 a1)
   added: (at p14 c2)
   goals met: 15 of 17
57. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 15 of 17
58. (fly a1 c2 c4 f2 f1)
   deleted: (at a1 c2) (fuel-level a1 f2)
   added: (at a1 c4) (fuel-level a1 f1)
   goals met: 15 of 17
59. (board p16 a1 c4)
   deleted: (at p16 c4)
   added: (in p16 a1)
   goals met: 15 of 17
60. (fly a1 c4 c3 f1 f0)
   deleted: (at a1 c4) (fuel-level a1 f1)
   added: (at a1 c3) (fuel-level a1 f0)
   goals met: 15 of 17
61. (debark p16 a1 c3)
   deleted: (in p16 a1)
   added: (at p16 c3)
   goals met: 16 of 17
62. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 16 of 17
63. (fly a1 c3 c5 f2 f1)
   deleted: (at a1 c3) (fuel-level a1 f2)
   added: (at a1 c5) (fuel-level a1 f1)
   goals met: 17 of 17
